# Оголошення персонажів
define i = Character("Я")
define angel = Character("Ангел")
define unknown = Character("???")

# Оголошення музичних доріжок
# define audio.idle_music = "audio/music/idle.wav"
# define audio.alarm_clock = "audio/sound/alarm_clock.mp3"

# Оголошення службових змінних
# Змінні виконаних завдань
define is_first_task_completed = False
define is_second_task_completed = False
define is_third_task_completed = False
# Змінні правильності виконання завдань
define is_first_task_right = False
define is_first_task_wrong = False
define is_second_task_right = False
define is_second_task_wrong = False
define is_third_task_right = False
define is_third_task_wrong = False
# Змінна лічильника виконання завдань
define task_counter = 0
# Змінні кінцівок
default persistent.paradise_ending = False
default persistent.hell_ending = False

# Оголошення ефекту розплющування та заплющування очей
init python:
    eye_open = ImageDissolve("images/art/eye.png", 0.5, 100)
    eye_close = ImageDissolve("images/art/eye.png", 0.5, 100, reverse=True)

label start:
    # scene dark
    "Останнім що я бачив у своєму житті були фари маленького фургончика."
    "Досить іронічно - все життя дивитись аніме в жанрі ісекай та сміятись із неправдоподібності зав'язки, і тепер опинитись тут же..."
    "Я більше не відчуваю свого тіла."
    "Нічого не болить."
    "Чи може це бути..{w} Смерть?"
    "Так, напевно це вона..."
    "Мене окутує пітьма та холод."
    "Страх сковує всі двадцять із чимось грами..."
    "Мої, напівпрозорі повіки пробиває яскраве світло."
    "Схоже мозок вже не працює, і настає сліпота."
    "А може це світло в кінці тунелю?"
    "..."
    unknown "Агов, хлопче, ти взагалі то можеш відкрити очі."
    i "..."
    unknown "Я серйозно. Відкрий очі, це виглядає дуже ніяково."
    "Почувши цю фразу мої спазмовано заплющенні очі самі-собою відкрились."
    # scene first with eye_open
    # show angel at center
    i "Перепрошую, а де богиня?"
    angel "Яка богиня? Я ж казав, що я ангел"
    i "Ну, так але зважаючи на умови моєї смерті, я думав, що можливо зможу переродитись у іншому світі, чи ще щось.."
    angel "Хто тобі таке сказав? І про який ти такий \"інший\" світ говориш?"
    "Я зрозумів, що це точно не ісекай і вирішив промовчати."
    i "Тоді хто ж ти, якщо не богиня?"
    unknown "Та що ти пристав з тією богинею?!"
    unknown "Ангел я, ангел.."
    i "Ангел?"
    angel "Та ангел, ангел. Ти що будеш повторювати все що я буду говорити?"
    i "Вибачте, пане ангеле, я більше не буду повторювати все за вами.."
    angel "От і добре. Давай приступимо до стандартної процедури."
    angel "Ти прожив недовге, несильно насичене життя, середньостатистичної людини твого часу."
    i "Ви, пане ангел, прямо таки по на рану сіль кидаєте.."
    angel "Як прожив так, і кажу. А ти мене не перебивай, а то наговорю всякого, і тебе одразу в пекло запишуть.."
    i "То, рай і пекло таки існують?"
    angel "Та, існує, існує. Не перебивай."
    angel "Отже, продовжимо."
    angel "Баланс поганих та гарних вчинків не поганий.."
    angel "Якихось великих гріхів не було помічено.."
    angel "Словом, ти не зробив нічого щоб заслужити потрапляння в пекло, але й до раю ти не дотягуєш.."
    i "То, що ж робити?"
    angel "Чесно тобі сказати, в такому випадку я би мав доставити тебе до розподільчого центру, щоб з тобою провели невеличке інтерв'ю та все ж відправили на переродження.."
    angel "Але знаєш, мені так лінь.."
    angel "Я буквально щоденно це роблю, по кілька разів на годину. Чесно кажучи мені якось набридло, а туди щей набагато далі летіти, тож давай так.."
    angel "Я дам тобі пергамент кармічного шляху більшого грішника за тебе, і якщо ти пройдеш його за три дні, то посмертний патруль подарує тобі крила, і ти одразу зможеш дістатись до раю."
    i "А якщо не встигну чи не впораюсь?"
    angel "Якщо не впораєшся, то в пекло."
    i "Тобто в пекло? І чому саме три дні?"
    angel "Три дні - це приблизний час, може менше, може більше. Тут все залежить від оперативності твоєї сім'ї, все ж таки коли твоє тіло поховають, то ти повністю втратиш зв'язок із цим світом, і тоді за тобою влаштують полювання посмертний патруль, щоб закинути тебе вже хоч кудись."
    i "Ти що намагаєшся мені сказати, що через твої лінощі, я маю проходити якийсь дурний квест за кілька днів, або потрапити в пекло?"
    angel "Саме так.."
    angel "А взагалі вини себе, якби ти хоч щось робив цьому житті, то просто потрапив би в рай, або в пекло. Ну, а так прожив абсолютно прісно, нічого по собі не лишивши, от я тобі і підкидую веселощів під його кінець.."
    i "Ти іще скажи, що я змарнував подарунок Божий.."
    angel "Чий?"
    i "Ну божий. Типу ваш головний, Аллах, Ісус, чи хто там у вас.."
    angel "Щось я не розумію про що ти.. Те що на Землі виникло життя - це суцільна удача. Поки що жодна планета у цілому всесвіті не бачила стільки ж випадковостей які змогли привести до того щоб могло заробитись життя."
    i "Тоді хто ти такий? Хіба ти людина?"
    angel "Ні, не людина. Я ж казав, що я ангел."
    angel "Ангелами споконвічно ставали люди які жили задля інших."
    i "Тобто все ж такий є якась вища сутність яка всім керує?"
    angel "Ні. Єдиною вищою сутністю в цьому світі є Всесвіт."
    angel "Він постійно розширяється створюючи нову матерію та енергію у суцільному вакуумі. Ми ж, ангели, просто обслуговуємо його перенаправляючи енергію."
    angel "Ми просто виконуємо свою роботу, підтримуючи циркуляцію енергії. Без цього все просто зупинилося б."
    i "Але чому ви це робите? І як ви розумієте, що вам потрібно робити саме це?"
    angel "Насправді ніхто не знає. Просто після смерті за нами не приходять інші ангели, натомість нам одразу після смерті даруються крила та свобода дій. В цілому будь хто з нас міг би відправитись в рай, чи вічно досліджувати неосяжний Всесвіт, але який інстинкт на рівні зі спрагою, рано чи пізно, просто притягує нас до цього місця, після чого ми просто стаємо до роботи."
    angel "До підтримки циркуляції енергії у Всесвіті."
    i "А до чого тут енергія?"
    angel "Ну, як до чого? Кожна жива істота під час життя поглинає та виділяє енергію, яка формує або змінює його душу."
    angel "Після смерті душа покидає тіло, а отже енергія просто гуляє, що порушує закони Всесвіту, тому ми і займаємось перенаправленням енергії."
    angel "По факту ми просто підтримуємо баланс енергій, перенаправляючи душі туди, де вони найкраще впишуться."
    i "Але, тоді для чого оці історії про рай та пекло?"
    angel "Чесно кажучи не знаю звідки ви дізнались наші терміни, але від того куди ти потрапляєш залежить просто які умови будуть у тебе під час очікування, приблизно сто років, а потім у яке тіло твою душу помістять."
    angel "Тобто якщо ти потрапляєш до пекла, то це буде якась собака, чи свиня, а якщо рай, то в людське тіло. Ось і вся різниця.."
    i "І для чого це? Нащо таке робити?"
    angel "Як для чого? Я ж казав, що життя на Землі це результат безлічі випадковостей, тому є цінним. Всесвіт великий та байдужий, але весь час прагне до балансу, тому життя на Землі є для нього досить важливим, з точки зору того щоб не втрачати енергію, тому ми намагаємось вибудувати баланс на Землі, щоб ви, люди, не перебили один одного, і не знищили баланс Всесвіту." 
    angel "Таким чином більш добрі люди перероджуються в людей, а грішники в тварин, рослини і таке інше. Це допомагає підтримувати рівновагу енергій і при цьому не дати домінуючому виду знищити себе та усіх інших."
    "Потік всієї цієї інформації збив мене з пантелику і я не міг перетравити всього почутого."
    angel "То що, тобі ще треба крила, чи одразу в пекло?"
    i "Та ж треба..."
    angel "Ну, то тримай."
    i "Чекай, а хіба ти можеш так зробити?"
    angel "Так, звісно. За нами по факту стежить тільки програма посмертного патруля, що виловлює ключові слова, ну а все інше ігнорується.."
    i "То, що буде із тим грішником кармічний шлях якого я отримав?"
    angel "В пекло."
    i "Але ж якщо я би не взяв його кармічний шлях, .."
    angel "Все одно в пекло. Він був у мене перед тобою і вже відмовився виконувати ці завдання, а я просто не встиг занести це на небеса, щоб утилізувати."
    i "..."
    angel "Ну, добре, не сумуй тут, і удачі тобі, а мені вже час на наступний виклик. Я полетів.."
    "Після цієї фрази ангел скрився за обрієм."
    "..."
    "Твою ж матір..."
    "Це що, якийсь божевільний сон?"
    "Але ж ні..."
    "Ангели. Справжні, чорт забирай, ангели."
    "Хоча, мабуть, краще не згадувати чорта в такій ситуації."
    "Ще й цей недороблений ангел..."
    "Від самої згадки про цього лінивого покидька у мене кров закипає."
    "Намагаючись втримати емоції під контролем, кулаки стиснулись самі собою."
    "Від звуку шурхоту в правій руці гнів трохи затих та вся увага перемкнулась на пергамент"
    "На ньому якимось дивним, ніби світлом підсвіченим, шрифтом нашкрябано три написи."
    "Примарний зв'язок"
    "Останній шанс"
    "Повернення на шлях"
    "..."
    jump task_list
    return

# Сцена вибору наступного завдання
label task_list:
    # scene task_list

    # Реакція на те список завдань залежно від кількості виконаних завдань
    if task_counter == 0:
        "Якась маячня, і як я маю, зрозуміти, що саме мені виконувати, якщо тут просто записані тупі назви для завдань."
        "Я що маю сам вгадувати, що робити чи що?"
    elif task_counter == 1:
        "Текст про те що після виконання завдання назва одного з завдань просто зникла"
    else:
        "У героя з'являється трохи азарту, бо він розуміє, що вже закінчує свій шлях"

    # Список завдань
    menu:
        "Примарний зв'язок" if not is_first_task_completed:
            jump first_task
        "Останній шанс" if not is_second_task_completed:
            jump second_task
        "Повернення на шлях" if not is_third_task_completed:
            jump third_task
    $ task_counter += 1
    return

# Сцена першого завдання
label first_task:
    "Текст першого завдання"
    menu:
        "Перший варіант":
            "Текст першого варіанту"
            $ is_first_task_right = True
        "Другий варіант":
            "Текст другого варіанту"
            $ is_first_task_wrong = True
    "Завершення першого завдання"
    $ is_first_task_completed = True
    jump ending
    return

# Сцена другого завдання
label second_task:
    "Текст другого завдання"
    menu:
        "Перший варіант":
            "Текст першого варіанту"
            $ is_second_task_right = True
        "Другий варіант":
            "Текст другого варіанту"
            $ is_second_task_wrong = True
    "Завершення другого завдання"
    $ is_second_task_completed = True
    jump ending
    return

# Сцена третього завдання
label third_task:
    "Текст третього завдання"
    menu:
        "Перший варіант":
            "Текст першого варіанту"
            $ is_third_task_right = True
        "Другий варіант":
            "Текст другого варіанту"
            $ is_third_task_wrong = True
    "Завершення третього завдання"
    $ is_third_task_completed = True
    jump ending
    return

# Мітка перевірки всіх завдань
label check_tasks:
    if is_first_task_completed and is_second_task_completed and is_third_task_completed:
        $ correct_tasks = 0

        if is_first_task_right:
            $ correct_tasks += 1
        if is_second_task_right:
            $ correct_tasks += 1
        if is_third_task_right:
            $ correct_tasks += 1

        if correct_tasks >= 2:
            jump paradise
        else:
            jump hell
    else:
        jump task_list
    return

# Мітка з універсальним текстом який буде в обох кінцівках з переходом в кінцівки
label ending:
    "Універсальний текст для обох кінцівок"
    "Приходить посмертний патруль"
    jump check_tasks
    return

# Кінцівка "Рай"
label paradise:
    "Текст кінцівки Рай"
    if correct_tasks == 2:
        "Деякий текст про те що виконані завдання не всі вірні"
        # Якщо виконано 2 з 3 завдань то має бути невеликий текст про те що головний герой типу не повністю впорався, але цього має бути достатньо, а от якщо 3 з 3, то нічого не мають казати
    "Завершення кінцівки Рай"
    window hide
    pause
    if persistent.paradise_ending == False:
        $ renpy.notify("Кінцівку \"Рай\" здобуто")
        $ persistent.paradise_ending = True
    return

# Кінцівка "Пекло"
label hell:
    "Текст кінцівки Пекло"
    "Завершення кінцівки Пекло"
    window hide
    pause
    if persistent.hell_ending == False:
        $ renpy.notify("Кінцівку \"Пекло\" здобуто")
        $ persistent.hell_ending = True
    return